// 天地图地址
var tianditu = "http://t{1-6}.tianditu.gov.cn/DataServer?T=vec_w&x={x}&y={y}&l={z}&tk=530dad1bfc5a88d60e566c101a095bbc"; // 地图
var tiandituTxt = "http://t{1-6}.tianditu.gov.cn/DataServer?T=cva_w&x={x}&y={y}&l={z}&tk=a64782b550587d3367380beec20779df"; // 省市县等区域文字

var gisConfig = {
  "isUsed": "jiangxilw", // 正在使用的配置项

  // 江西路网
  "jiangxilw": {
    "gisIp": "http://222.249.173.36:6305", // 地图服务器地址
    "initMapUrl": "/geoserver/jxdemo/wms", // 地图初始化地址
    "mapType": "geoserver", // 地图类型
    // 地图全图范围
    "fullExtent": [
      113.580253601074,
      24.5224494934082,
      118.393119812012,
      30.0793762207031
    ],
    "mapCenter": [115.71899, 28.11401], // 地图中心点
    "initZoom": 8, // 地图当前缩放级别
    "minZoom": 6, // 最小缩放级别
    "maxZoom": 20, // 最大缩放级别
    "origin": [113.580253601074, 24.5224494934082],

    // 白色底图
    "theme1": {
      "gisIp": "http://111.75.227.156:18984", // 地图服务器地址
      "initMapUrl": "/xxzx_admin_site01/rest/services/JXMAP_ALL/MapServer/tile/\{z}/\{y}/\{x}", // 地图初始化地址
      "mapType": "arcgis", // 地图类型
      // 地图全图范围
      "fullExtent": [
        109.76098439045025,
        24.071172729111456,
        122.44731868913497,
        30.57281198144211
      ],
      "mapCenter": [116.01, 28.67], // 地图中心点
      "initZoom": 0, // 地图当前缩放级别
      "minZoom": 0, // 最小缩放级别
      "maxZoom": 12, // 最大缩放级别
      "origin": [-400.0, 399.9999999999998],
      "resolutions": [
        0.010986328383069278,
        0.005493164191534639,
        0.0027465809060368165,
        0.0013732916427489112,
        6.866458213744556E-4,
        3.433229106872278E-4,
        1.716614553436139E-4,
        8.582953794130404E-5,
        4.291595870115493E-5,
        2.1457979350577466E-5,
        1.0728989675288733E-5,
        5.363305107141452E-6,
        2.681652553570726E-6
      ]
    },

    // 蓝色地图
    "theme2": {
      "gisIp": "http://36.2.11.1:6080", // 地图服务器地址
      "initMapUrl": "/arcgis/rest/services/jiangxi/JXMAP_BLUE/MapServer/tile/\{z}/\{y}/\{x}", // 地图初始化地址
      "initLayers": "", // 底图名
      "mapType": "arcgis", // 地图类型
      // 地图全图范围
      "fullExtent": [
        40.93120507614668,
        -4.898838628946014,
        172.62495510997238,
        59.89417413221303
      ],
      "mapCenter": [115.966, 27.67], // 地图中心点
      "initZoom": 3, // 地图当前缩放级别
      "minZoom": 0, // 最小缩放级别
      "maxZoom": 13, // 最大缩放级别
      "origin": [-400.0, 399.9999999999998],
      "resolutions": [
        0.04394531353227711,
        0.021972656766138556,
        0.010986328383069278,
        0.005493164191534639,
        0.0027465809060368165,
        0.0013732916427489112,
        6.866458213744556E-4,
        3.433229106872278E-4,
        1.716614553436139E-4,
        8.582953794130404E-5,
        4.291595870115493E-5,
        2.1457979350577466E-5,
        1.0728989675288733E-5,
        5.363305107141452E-6
      ]
    },
  }
};
